//#include<stdio.h>
//
//
//int main() {
//	//位操作符--只能用于整数 
//	// 按位& 按位| 按位异或^
//	// 
//	//按位& 每一个二进制位对比 同真为真 变量本身或者111相与等于本身
//	int a = 2;				 //0000 0000 0000 0000 0000 0000 0000 0010
//	int a1 = 1;				 //0000 0000 0000 0000 0000 0000 0000 0001
//	int a2 = a & a1;		 //0000 0000 0000 0000 0000 0000 0000 0000
//	printf("%d\n", a2);
//	//按位| 每一个二进制位对比 同假为假 变量同本身或者000相或等于本身
//	a2 = a | a1;			 //0000 0000 0000 0000 0000 0000 0000 0011
//	printf("%d\n", a2);
//	//按位^ 每一个二进制位对比 不同为真，相同为假 本身相异或等于0
//	a2 = a ^ a1;			 //0000 0000 0000 0000 0000 0000 0000 0011
//	printf("%d\n", a2);
//	return 0;
//}
