////关注的是数本身的真假 而不是二进制位
////   与&&  同真为真
////   或||	同假为假
//
//
//#include<stdio.h>
//
//int main() {
//	int i = 0, a = 0, b = 2, c = 3, d = 4;
//	i = a++ && ++b && d++;
//	printf("%d %d %d %d\n", a, b, c, d);//结果为1234   当&&的左边为假这个&&直接就停止了
//
//	int i1 = 0, a1 = 1, b1 = 2, c1 = 3, d1 = 4;
//	i = a1++ && ++b1 && d1++;
//	printf("%d %d %d %d\n", a1, b1, c1, d1);//结果为2335
//
//	int i2 = 0, a2 = 0, b2 = 2, c2 = 3, d2 = 4;
//	i = a2++ || ++b2 || d2++;
//	printf("%d %d %d %d\n", a2, b2, c2, d2);//结果为1334 
//
//	int i3 = 0, a3 = 1, b3 = 2, c3 = 3, d3 = 4;
//	i = a3++ || ++b3 || d3++;
//	printf("%d %d %d %d\n", a3, b3, c3, d3);//结果为2234  //当||的左边为真就停止运行
//
//	return 0;
//}