//#include<stdio.h>
//
//int main() {
//
//	//例一
//	char a = 0xb6;				//10110110
//								//11111111 11111111 11111111 10110110
//								//截断						 10110110
//								
//
//	short b = 0xb600;			//10110110 00000000
//								//11111111 11111111 10110110 00000000
//								//截断				10110110 00000000
//	
//	int c = 0xb6000000;			//10110110 00000000 00000000 00000000
//								
//	if (a == 0xb6)//变量整型提升，而数却不会整型提升所以不相等
//		printf("a\n");
//	if (b == 0xb600)
//		printf("b\n");
//	if (c == 0xb6000000)
//		printf("c\n");
//
//	//例二
//	a = 1;
//	printf("%u\n", sizeof(a));//结果为1 4 1 因为涉及到+运算会整型提升。
//	printf("%u\n", sizeof(+a));
//	printf("%u\n", sizeof(!a));
//	return 0;
//}

//算术转换，即在计算时需要先将小类型的转换为大类型的，并且是逐级转换