//#define _CRT_SECURE_NO_WARNINGS 1
//#include<stdio.h>
//
//int main() {
//
//
//	//算术运算符   + - * / % ++ --
//	int a = 5, b = 2,c;
//	c = a % b;//取模运算,求余运算;
//	printf("c=%d\n", c);
//
//
//
//	//移位运算符
//	//右移>>  左移<< 移的是二进制位
//	int d = 1,d2;
//	//00000000000000000000000000000001
//	d2=d << 1;//此处的1代表移一个二进制位；前面的丢弃；
//	//00000000000000000000000000000010
//	printf("d2=%d\n", d2);
//
//
//	//位运算符---二进制位
//	//   按位或|  按位与&  按位异或 ^ 按位取反~
//	int n1 = 1,n2=0;
//	c = n1 | n2;
//	printf("n1|n2=%d\n", c);//对应的位分别做或运算
//	c = n1 & n2;
//	printf("n1&n2=%d\n", c);//对应的位分别做与运算
//	c = n1 ^ n2;
//	printf("n1^n2=%d\n", c);//对应的位分别做异或运算
//	c = ~n1;
//	//n1补码					00000000000000000000000000000001
//	//n1按位取反得到的补码		11111111111111111111111111111110
//	//由补码得原码              10000000000000000000000000000010
//	printf("~n1=%d\n", c);//对应的位分别做按位取反运算 结果为-2 因为计算机中整数是以二进制补码的方式存储的
//	//按位运取反算时找到对应变量，将对应的补码按位取反 打印时需要将补码转换为原码再读出数值，因为打印的是int型；
//	
//	//原码 反码 补码
//	// 原码=符号位+数值位；0正1负
//	//正数的原码=反码=补码
//	//负数的反码等于原码符号位不变，数值位按位取反
//	//负数的补码等于补码加一
//
//
//	//单目运算符
//	//   ~按位取反
//	//  ！逻辑取反
//	//  &  取地址
//
//	//自增自减运算  ++ -- 
//	printf("初%d\n", n1);
//	printf("末%d\n", n1++);//表达式的值规律   加前取值  n++值与n加之前相同
//	printf("初%d\n", n1);
//	printf("末%d\n", ++n1);//表达式的值   加后取值  下面同理
//	printf("初%d\n", n1);
//	printf("末%d\n", n1--);
//	printf("初%d\n", n1);
//	printf("末%d\n", --n1);
//	
//	// sizeof
//	//利用sizeof求数组长度
//	int arr[] = { 1,2,3,4,5 };
//	int size;
//	size = sizeof arr / sizeof(arr[0]);//当sizeof后计算的是变量 可用不用（）
//	printf("size =%d \n", size);
//	//  (数据类型)强制类型转换
//	int n3 = (int)3.14;
//	
// 
//	
//	//双目运算符  + - * / %
//	 
//	 
//	//三目运算符  表达式?表达式2（表达式为真执行）:表达式3（表达式为假执行） 返回值为一个变量可修改值
//	int max;
//	max = n1 > n2 ? n1 : n2;
//	printf("max=%d", max);
//
//	//比较运算符  ==  > <  >=  <=
//	//逻辑运算符
//	//逻辑与（同真为真）&&   逻辑或（同假为假）|| 逻辑非（真假互换） !  通常作为条件  
//
//	//逗号运算符  ，
//	//下标引用操作符[]
//	//  . 
//	//  ->
//	return 0;
//}